In [2]:
import numpy as np
from numpy import nan
import pandas as pd
from pandas import Series,DataFrame
from numpy.random import randn

## 欠損値の扱い
シリーズ

In [3]:
data = Series([1,2,nan,3])

In [4]:
data

0    1.0
1    2.0
2    NaN
3    3.0
dtype: float64

In [5]:
data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
data.dropna()

0    1.0
1    2.0
3    3.0
dtype: float64

データフレーム

In [15]:
dframe = DataFrame([[1,2,0],[nan,5,5],[nan,4,4]])

In [16]:
dframe

     0  1  2
0  1.0  2  0
1  NaN  5  5
2  NaN  4  4

In [17]:
dframe.isnull()

       0      1      2
0  False  False  False
1   True  False  False
2   True  False  False

In [20]:
dframe.dropna(how='all')
#欠損値のある行が全て消えている
#how allだと全てが欠損地の行だけが消える

     0  1  2
0  1.0  2  0
1  NaN  5  5
2  NaN  4  4

In [21]:
dframe.dropna(axis=1)
#列方向を対象に欠損値の検索をかける

   1  2
0  2  0
1  5  5
2  4  4

In [22]:
dframe2 = DataFrame([[nan,1,1,1],[nan,nan,nan,3],[3,3,3,nan],[nan,nan,3,3]])

In [23]:
dframe2

     0    1    2    3
0  NaN  1.0  1.0  1.0
1  NaN  NaN  NaN  3.0
2  3.0  3.0  3.0  NaN
3  NaN  NaN  3.0  3.0

In [24]:
dframe2.dropna(thresh=2)
# 欠損値じゃない値が何個あるか

     0    1    2    3
0  NaN  1.0  1.0  1.0
2  3.0  3.0  3.0  NaN
3  NaN  NaN  3.0  3.0

In [25]:
dframe2.dropna(thresh=3)

     0    1    2    3
0  NaN  1.0  1.0  1.0
2  3.0  3.0  3.0  NaN

In [26]:
dframe2.fillna(1)
# 埋めるデータを決めることができる

     0    1    2    3
0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  3.0
2  3.0  3.0  3.0  1.0
3  1.0  1.0  3.0  3.0

In [27]:
dframe2.fillna({0:0,1:1,2:2,3:3})
# 列ごとに埋めるデータを決める

     0    1    2    3
0  0.0  1.0  1.0  1.0
1  0.0  1.0  2.0  3.0
2  3.0  3.0  3.0  3.0
3  0.0  1.0  3.0  3.0

In [28]:
dframe2.fillna(0, inplace=True)
# データフレームを変更する